{"/api-ref/other":{"sections":[]},"/api-ref":{"sections":[{"heading":{"id":"api-reference","depth":1,"text":"API Reference"},"content":""}],"pageTitle":"API Reference"},"/docs/misc/the-cure":{"sections":[{"heading":{"id":"the-cure-for-always-being-late","depth":1,"text":"The cure for always being late"},"content":""}],"pageTitle":"The cure for always being late"},"/docs/misc":{"sections":[{"heading":{"id":"misc","depth":1,"text":"Misc"},"content":""}],"pageTitle":"Misc"},"/docs/guides/troubleshooting":{"sections":[{"heading":{"id":"troubleshooting","depth":1,"text":"Troubleshooting"},"content":""}],"pageTitle":"Troubleshooting"},"/docs/guides":{"sections":[{"heading":{"id":"what-is-polymarket","depth":1,"text":"What is Polymarket?"},"content":"Polymarket is the world's largest prediction market. It gives you the opportunity to profit from your beliefs by betting on the outcome of future events across various topics such as sports, politics, and pop culture. Our markets reflect accurate, unbiased, real-time probabilities for events that matter most to you. Markets seek truth."},{"heading":{"id":"understanding-prices","depth":3,"text":"Understanding Prices"},"content":" Prices = probabilities. Prices (odds) on Polymarket represent the current probability of an event occurring. For example, in a market predicting whether the Miami Heat will win the 2025 NBA Finals, if “Yes” shares are trading at 18 cents, it indicates a 18% chance of Miami winning."},{"heading":{"id":"making-money-on-markets","depth":3,"text":"Making money on markets"},"content":" In the example above, if you believe Miami's chances of winning are higher than 18%, you would buy “Yes” shares at 18 cents each. If Miami wins, each “Yes” share would be worth $1, resulting in an 82-cent profit per share. Conversely, any trader who owned “No” shares would see their investment become worthless once the game is over. Since it's a market, you're not locked into your trade. You can sell your shares at any time at the current market price. As the news changes, the supply and demand for shares fluctuates, causing the share price to reflect the new odds for the event."},{"heading":{"id":"how-accurate-are-polymarket-odds","depth":3,"text":"How accurate are Polymarket odds?"},"content":" Research shows prediction markets are often more accurate than polls and pundits. Traders aggregate news, polls, and expert opinions, making informed trades. Their economic incentives ensure market prices adjust to reflect true odds as more knowledgeable participants join. This makes prediction markets the best source of real-time event probabilities. People use Polymarket for the most accurate odds, gaining the ability to make informed decisions about the future. If you're an expert on a certain topic, Polymarket is your opportunity to profit from trading based on your knowledge, while improving the market's accuracy."}],"pageTitle":"What is Polymarket?"},"/docs/guides/how-to":{"sections":[{"heading":{"id":"how-to","depth":1,"text":"How to?"},"content":"This is a test"},{"heading":{"id":"this-is-inline-code-inside-a-heading","depth":2,"text":"This is inline code inside a heading"},"content":" Wow!"},{"heading":{"id":"even-more-inline-code-ts-inside-a-heading","depth":1,"text":"Even more inlineCode(){:ts} inside a heading!"},"content":" Even wower!"}],"pageTitle":"How to?"},"/docs/guides/github":{"sections":[{"heading":{"id":"all-markdown-and-components","depth":1,"text":"All markdown and components"},"content":"This page describes all markdown and components that are supported by @neato/guider."},{"heading":{"id":"inline-styles","depth":2,"text":"Inline styles"},"content":" These are all inline styles. This is bold textThis text is italicizedThis is strikethrough textThis text is extremely importantAll this text is importantThis text has Inline code inside it. The following has inline syntax highlighting:  const ts = \"test\"{:ts}. Very cool!"},{"heading":{"id":"scripts","depth":3,"text":"Scripts"},"content":" Sometimes you want to use sub or superscript, this is how that looks: This is a  subscript text This is a  superscript text"},{"heading":{"id":"quotes","depth":2,"text":"Quotes"},"content":" Text that is not a quote Text that is a quote A multiline quote, It's a few lines long!"},{"heading":{"id":"links","depth":2,"text":"Links"},"content":" Links can be embedded in standard markdown style  like this.\r\nBut you can also just paste links and it will work:  https://google.com. Using the same syntax with an exclamation mark in front of it will embed an image:\r\n"},{"heading":{"id":"code-blocks","depth":2,"text":"Code blocks"},"content":" Here is a basic code block: With a language specified: Scrollable code block: Code block with line numbers: Code block with title: Code block with npm2yarn integration: Normal frame"},{"heading":{"id":"callouts","depth":2,"text":"Callouts"},"content":" Hello world! Hello world! Hello world! Hello world! Hello world!"},{"heading":{"id":"steppers","depth":2,"text":"Steppers"},"content":""},{"heading":{"id":"second-step","depth":3,"text":"Second step"},"content":" This is the first step!"},{"heading":{"id":"second-step","depth":3,"text":"Second step"},"content":" This is the second step! This is the third step!\r\nYou don't need a title btw"},{"heading":{"id":"tabs","depth":2,"text":"Tabs"},"content":" Tab number one! Tab number two! Tab number three!"},{"heading":{"id":"dividers","depth":2,"text":"Dividers"},"content":" Here is some text Here is more text!"},{"heading":{"id":"lists","depth":2,"text":"Lists"},"content":" Unordered list:George Washington John Adams Thomas Jefferson Numbered list:James Madison James Monroe John Quincy Adams Another numbered list:James Madison James Monroe John Quincy Adams Nested list:First list item First nested list item Second nested list item Task list:Task one Task two Task three :tada:"},{"heading":{"id":"foot-notes","depth":2,"text":"Foot notes"},"content":" Here is a simple footnote.\r\nA footnote can also have multiple lines. My reference. To add line breaks within a footnote, prefix new lines with 2 spaces.\r\nThis is a second line. You can look at the bottom of the page for all the footnotes."},{"heading":{"id":"tables","depth":2,"text":"Tables"},"content":" Left-aligned Center-aligned Right-aligned git status git status git status git diff git diff git diff Command Description git status List all  new or modified files git diff Show file differences that  haven't been staged git status git status git status git diff git diff git diff"},{"heading":{"id":"frames","depth":2,"text":"Frames"},"content":" Frames are a neat way to showcase previews or components. Normal frame Plain frame"}],"pageTitle":"All markdown and components"},"/docs/cli/tennant":{"sections":[{"heading":{"id":"the-egregious-state-of-david-tennants-hair","depth":1,"text":"The Egregious State of David Tennant's Hair"},"content":"Oh, David Tennant, let's delve into the quagmire that is your hair situation. It's reached a point where it's not just an observation; it's a full-blown crisis that demands our attention. Strap in, because we're about to embark on a follicular odyssey."},{"heading":{"id":"the-unraveling-disaster-of-the-follicular-realm","depth":2,"text":"The Unraveling Disaster of the Follicular Realm"},"content":" Firstly, one cannot simply ignore the cataclysmic disaster that has befallen the realm of your follicles. It's as if a tornado made of chaos and disregard has swept through, leaving behind a tangled landscape that even the bravest adventurer would hesitate to traverse. Have you no regard for the basic principles of grooming, Tennant?"},{"heading":{"id":"a-tangled-web-of-hair-lies-and-deception","depth":2,"text":"A Tangled Web of Hair, Lies, and Deception"},"content":" The tangled web atop your head is not just a manifestation of unkempt strands; it's a labyrinth of lies and deception. Each strand seems to have its own agenda, weaving a narrative of neglect and defiance. It's like a Shakespearean tragedy played out in the strands of your hair, and we, the audience, are left in bewilderment."},{"heading":{"id":"the-shakespearean-tragedy-of-the-receding-hairline","depth":2,"text":"The Shakespearean Tragedy of the Receding Hairline"},"content":" Speaking of Shakespearean tragedies, let's address the receding hairline—a dramatic saga unfolding on the stage that is your forehead. It's a slow descent into the abyss, a tragedy that even the most seasoned playwright would find challenging to script. Is this a deliberate act of self-sabotage, Tennant, or just a tragic twist of fate?"},{"heading":{"id":"a-cry-for-help-echoing-in-the-halls-of-hair-despair","depth":2,"text":"A Cry for Help Echoing in the Halls of Hair Despair"},"content":" The disarray atop your head isn't just a grooming faux pas; it's a desperate cry for help echoing through the hallowed halls of hair despair. One can't help but wonder if your follicles are staging a mutiny, demanding attention and care. Perhaps it's time to listen to the silent screams of your neglected strands and seek redemption in the form of a skilled hairstylist."},{"heading":{"id":"the-gravity-defying-act-of-follicular-rebellion","depth":2,"text":"The Gravity-Defying Act of Follicular Rebellion"},"content":" Let's talk about the gravity-defying act your hair has been performing with unwavering determination. It's as if each strand has declared independence from the laws of physics, defying gravity and reason simultaneously. I fear we're witnessing a rebellion of follicular proportions, and it's high time you bring this insurgency under control before it spirals into complete anarchy."},{"heading":{"id":"lost-in-the-wilderness-a-follicular-odyssey","depth":2,"text":"Lost in the Wilderness: A Follicular Odyssey"},"content":" Your hair has become a metaphorical wilderness, lost in the annals of neglect and indifference. It's a journey through the untamed landscapes of follicular disregard, a wilderness that, if left unchecked, may never find its way back to the civilized realms of well-groomed elegance. Are we witnessing a deliberate attempt to embrace the wild, or is this a case of being lost in the tangled thickets of neglect?"},{"heading":{"id":"the-breaking-point-a-rant-unleashed-in-the-follicular-arena","depth":2,"text":"The Breaking Point: A Rant Unleashed in the Follicular Arena"},"content":" I've restrained myself for far too long, Tennant. This isn't just a gentle nudge toward a salon; this is a full-blown rant unleashed upon the follicular arena. The state of your hair is an affront to good taste and an insult to the very notion of personal grooming. It's time to grab the reins of sanity and head straight to a salon, where a professional can wage war against the chaos that has taken residence atop your head."},{"heading":{"id":"intervention-required-immediately-a-plea-for-follicular-redemption","depth":2,"text":"Intervention Required, Immediately: A Plea for Follicular Redemption"},"content":" In conclusion, David Tennant, consider this not just a plea but a desperate cry for follicular redemption. It's time to intervene, to salvage what's left of your once-respectable mane. Seek refuge in the hands of a skilled hairstylist who can restore order to the chaos and bring about a Renaissance in the realm of your hair. The time for action is now, lest your follicles become a cautionary tale for generations to come."}],"pageTitle":"The Egregious State of David Tennant's Hair"},"/docs/cli":{"sections":[{"heading":{"id":"cli","depth":1,"text":"CLI"},"content":""}],"pageTitle":"CLI"},"/docs/cli/cli-b":{"sections":[{"heading":{"id":"cli-b","depth":1,"text":"CLI - b"},"content":""}],"pageTitle":"CLI - b"},"/docs/cli/cli-a":{"sections":[{"heading":{"id":"cli-a","depth":1,"text":"CLI - a"},"content":""}],"pageTitle":"CLI - a"},"/docs/guides/trading/using-the-orderbook":{"sections":[{"heading":{"id":"using-the-order-book","depth":1,"text":"Using the Order Book"},"content":""},{"heading":{"id":"using-the-order-book","depth":3,"text":"Using the Order Book"},"content":"Understanding the Order Book will help you become an advanced trader.\r\nIn the Getting Started tutorial on  Making your First Trade, we learned about market orders. In a market order, your trade executes instantly at the current market price.\r\nBut what if you think the market price is too high and want to set a specific price that you would be willing to accept? These are called  Limit Orders."},{"heading":{"id":"viewing-the-order-book","depth":3,"text":"Viewing the Order Book"},"content":" The order book is a list of every open order to buy or sell shares in a particular market. In this market,  “Presidential Election Winner 2024”, we are viewing the order book for Trump  Yes shares. The green side represents the  Bids: the highest price traders are willing to pay to buy Trump  Yes\r\nshares. The red side represents the  Asks: the lowest price traders are willing to accept to sell Trump  Yes shares. Notice that there is a 0.3c gap between the highest bid and the lowest ask price. This is referred to as the spread."},{"heading":{"id":"managing-open-orders","depth":3,"text":"Managing Open Orders"},"content":" When you have an open order, you'll find it displayed just below the Order Book on the market's page. If you have open orders across multiple markets, you can easily manage and monitor them all from the  Portfolio page. To cancel the order, you can simply click the red  x button alongside the order. If some of this still isn’t making sense, feel free to reach out to us on  Discord. We’re happy to help get you up to speed."}],"pageTitle":"Using the Order Book"},"/docs/guides/trading/no-limits":{"sections":[{"heading":{"id":"does-polymarket-have-trading-limits","depth":1,"text":"Does Polymarket Have Trading Limits?"},"content":"By design, the Polymarket orderbook  does not have trading size limits. It matches willing buyers and sellers of any amount. However, there is no guarantee that it will be possible to transact a desired amount of shares without impacting the price significantly, or at all if there are no willing counterparties. Before trading in any market, especially in large size, it is valuable to look at the orderbook to understand depth of liquidity, ie how many buyers or sellers are in the market and their desired trade size and price."}],"pageTitle":"Does Polymarket Have Trading Limits?"},"/docs/guides/trading/limit-orders":{"sections":[{"heading":{"id":"limit-orders","depth":1,"text":"Limit orders"},"content":"What are limit orders and how to make them."},{"heading":{"id":"what-are-limit-orders","depth":3,"text":"What are Limit Orders?"},"content":"Limit orders are open orders (pending trades) that only execute when the market trades at your desired price. For example, if the highest you’re willing to pay for a share of Trump “Yes” in the 2024 Republican Nomination is 72c, but the current market price is 73c, you could create a limit order at 72c and wait until someone is willing to sell Yes shares at your desired price. It’s not necessary for the entire order to execute at once. Limit orders can ‘partially fill’ as individual traders fill parts of your order."},{"heading":{"id":"how-to-make-a-limit-order","depth":3,"text":"How to make a Limit Order"},"content":" In the buy modal, select  limit in the order type dropdown. Enter the price you are willing to buy (or sell, if you’ve selected to sell) shares at. Enter the number of shares you want to buy or sell at that price. Optional: Set an expiration date for your limit order. This means that if the order does not execute at your desired price within this timeframe, it will be canceled. Click  Buy and confirm the transaction in your wallet. Your limited orders that have yet to be filled are called \"Open Orders\"."},{"heading":{"id":"canceling-your-open-order","depth":3,"text":"Canceling your Open Order"},"content":" When you have an open order, you'll find it displayed just below the Order Book on the market's page. To cancel the order, you can simply click the red  x button alongside the order. If you have open orders across multiple markets, you can easily manage and monitor them all from the  Portfolio page. Nice! You can officially call yourself an advanced trader. If some of this still isn’t making sense, feel free to reach out to us on  Discord. We’re happy to help get you up to speed."}],"pageTitle":"Limit orders"},"/docs/guides/trading/how-are-prices-calculated":{"sections":[{"heading":{"id":"how-are-prices-calculated","depth":1,"text":"How are prices calculated?"},"content":"The prices probabilities displayed on Polymarket are the midpoint of the bid-ask spread in the orderbook.Prices = probabilities. The probabilities displayed on Polymarket are the midpoint of the bid-ask spread in the orderbook. For example, in this market, the probability of 37% is the midpoint between the 34¢ bid and 40¢ ask. If the bid-ask spread is wider than 10¢, the probability is shown as the last traded price. You may not be able to buy shares at the displayed probability / price because there is a bid-ask spread. In the above example, a trader wanting to buy shares would pay 40¢ for up to 4,200 shares, after which the price would rise to 43¢."}],"pageTitle":"How are prices calculated?"},"/docs/guides/trading/fees":{"sections":[{"heading":{"id":"trading-fees","depth":1,"text":"Trading Fees"},"content":"Polymarket does not charge any type of fee.There are no fees to deposit or withdraw USDC, although intermediaries such as Paypal, Coinbase, Robinhood, etc may charge transaction fees. There are no fees to trade shares in any market."}],"pageTitle":"Trading Fees"},"/docs/guides/trading/exiting-positions":{"sections":[{"heading":{"id":"can-i-sell-early","depth":1,"text":"Can I sell early"},"content":"Instant cash outs on PolymarketYou may sell shares at any point before the market is resolved by either placing a market order to sell shares at the prevailing bid price in the orderbook, or by placing a limit order for how many shares you wish to sell and at what price. The limit order will only be executed if/when there is a willing buyer for your shares at the price you set."}],"pageTitle":"Can I sell early"},"/docs/guides/markets/how-are-markets-resolved":{"sections":[{"heading":{"id":"how-are-markets-resolved","depth":1,"text":"How are Markets Resolved"},"content":"Markets are resolved by the UMA Optimistic Oracle, a smart-contract based optimistic oracle.When the result of a market becomes clear, the market can be “resolved,” or permanently finalized. When a market is resolved, holders of winning shares receive $1 per share, losing shares become worthless, and trading of shares is no longer possible. To resolve, a market must be “proposed,” which involves putting up a bond in USDC.e which will be forfeited if the proposal is unsuccessful. If your proposal is validated as accurate, you will receive a reward for your proposal. If you propose a market too early, or are unsuccessful in your proposal, you will lose all of your $750 bond. Do not propose a resolution unless you understand the process and are confident in your view."},{"heading":{"id":"to-propose-a-market-resolution","depth":3,"text":"To propose a market resolution:"},"content":" Navigate to the market you want to propose and click Resolution > Propose Resolution. You will be taken to the corresponding Uma oracle page for the market, which shows the bond required and reward for successful proposal. Ensure that you have enough USDC.e in your wallet on Polygon to supply the bond\r\nSelect the option you would like to propose from the drop-down menu labeled Request(price). Connect your wallet and submit the transaction. It will now enter the Uma Oracle’s verification queue. Once in the verification process, Uma will review the transaction to ensure it was proposed correctly. If approved, you will receive your bond amount back in your wallet plus the reward. If not approved, it will enter Uma’s dispute resolution process, which is described in detail here."},{"heading":{"id":"can-i-create-my-own-market","depth":3,"text":"Can I Create My Own Market?"},"content":" Users cannot create their own markets, but are encouraged to suggest ideas for new markets. The best ways to suggest a new market are: On  Twitter / X by tagging @polymarket On  Discord in the #market-suggestion channel To give your market suggestion the best chance of being listed, include as much information as possible, such as: Name of the market Evidence of demand for trading the market Does the market have any social or news value? What is the exact question the market will answer? What is the proposed source of resolution for the market?"}],"pageTitle":"How are Markets Resolved"},"/docs/guides/markets/how-are-markets-created":{"sections":[{"heading":{"id":"how-are-markets-created","depth":1,"text":"How are Markets Created?"},"content":"Markets are created by the markets team with input from users and the community.In choosing which markets to list, Polymarket considers the following factors: Is there enough demand for trading in the market to produce an accurate probability? Polymarket targets $X in trading volume as a minimum. Is there social good or news value in understanding the probability generated by the market? Can the market be resolved clearly? This is usually a “Yes” / “No” question like “Will Michelle Obama win the 2024 US Presidential Election?” or a multiple choice question like “At the September 2024 meeting, will the Federal Reserve a) leave rates unchanged; b) cut rates 25 bps; c) cut rates 50 bps, etc.” Is there a credible information source for market resolution? For example, a country’s elections commission can be specified as the official resolution source for an election. Can the market be resolved in a definite time frame?"}],"pageTitle":"How are markets created?"},"/docs/guides/markets/how-are-markets-clarified":{"sections":[{"heading":{"id":"how-are-markets-clarified","depth":1,"text":"How are Markets Clarified?"},"content":"In rare cases, circumstances occur that were not foreseen at a market’s creation and it becomes necessary to clarify rules after trading has begun. In these cases Polymarket may issue an “Additional context” update to the rules. If you believe a clarification is necessary for a market, the best place to request a clarification is in the  Polymarket Discord  #market-review channel."}],"pageTitle":"How Are Markets Clarified?"},"/docs/guides/markets/dispute":{"sections":[{"heading":{"id":"how-are-markets-disputed","depth":1,"text":"How are Markets Disputed?"},"content":"Anyone can dispute a proposed market resolution if they feel it was proposed in error.Once a market is proposed for resolution it goes into a challenge period of 2 hours.\r\nIf no one challenges the proposal the resolution is deemed valid and the proposer receives their bond back plus the reward. During the 2-hour challenge period, anyone may dispute the proposal on the UMA dapp:  https://oracle.uma.xyz/ by posting a challenge bond of the same amount as the proposer bond (usually $750).\r\nThis begins the debate period of 24-48 hours (votes happen every other day and there will always be at least 24 hours for discussion). Anyone wishing to contribute evidence to the discussion can do so in the Uma Discord server in the #evidence-rationale and #voting-discussion channels. After the debate period, Uma token holders vote (this process takes approximately 48 hours) and one of four outcomes happens: Proposer wins: Proposer receives their bond back plus half the disputer’s bond as a bounty. Disputer loses their bond. Disputer wins: Disputer receives their bond back plus half the proposer’s bond as a bounty. Proposer loses their bond. Too Early: This outcome is for proposals for which the underlying event has not yet happened. Eg the result of a sports match that is still ongoing. Disputer receives their bond back plus half the proposer’s bond as a bounty. Proposer loses their bond. Unknown/50-50: This (rarely used) outcome is for events where none of the other options are appropriate. In this case the market price resolves to 50 yes and 50 no. Disputer receives their bond back plus half the proposer’s bond as a bounty. Proposer loses their bond."}],"pageTitle":"How Are Markets Disputed?"},"/docs/guides/markets/can-anyone-make-a-market":{"sections":[{"heading":{"id":"can-i-create-my-own-market","depth":1,"text":"Can I Create My Own Market?"},"content":"Users cannot create their own markets, but are encouraged to suggest ideas for new markets.The best ways to suggest a new market are: On Twitter / X by tagging  @polymarketOn  Discord in the  #market-suggestion channel To give your market suggestion the best chance of being listed, include as much information as possible, such as: Name of the market Evidence of demand for trading the market Does the market have any social or news value? What is the exact question the market will answer? What is the proposed source of resolution for the market?"}],"pageTitle":"Can I create my own market?"},"/docs/guides/FAQ/why-do-i-need-crypto":{"sections":[{"heading":{"id":"why-crypto","depth":1,"text":"Why Crypto?"},"content":"Why Polymarket uses crypto and blockchain technology to create the world’s largest Prediction market.Polymarket operates on Polygon, a proof-of-stake layer two blockchain built on  Ethereum. All transactions are denominated in USDC, a US-dollar pegged stablecoin. This architecture offers several advantages over traditional prediction markets:"},{"heading":{"id":"stable-value","depth":3,"text":"Stable Value."},"content":" Polymarket denominates trades in USDC, which is pegged 1:1 to the US Dollar. This shields you from the volatility associated with other cryptocurrencies and offers a stable medium for trading."},{"heading":{"id":"regulated-reserves","depth":3,"text":"Regulated Reserves"},"content":" USDC operates in adherence to regulatory standards and is backed by reserved assets."},{"heading":{"id":"transparency","depth":3,"text":"Transparency"},"content":" Blockchain technology facilitates transparency, as all transactions are recorded publicly."},{"heading":{"id":"global-reach","depth":3,"text":"Global Reach"},"content":" Research has shown that wide availability of prediction markets increases their accuracy. Using decentralized blockchain technology removes the need for a central authority in trading, which fosters fairness and open participation around the globe."}],"pageTitle":"Why Crypto?"},"/docs/guides/FAQ/wen-token":{"sections":[{"heading":{"id":"does-polymarket-have-a-token-or-planned-airdrop","depth":1,"text":"Does Polymarket have a Token or Planned Airdrop?"},"content":"Polymarket does not have a token.All trading and liquidity rewards are in USDC, a USD-pegged stablecoin. Polymarket has not announced plans for any airdrop or token generation event. Be wary of scams claiming airdrops, giveaways, etc. If in doubt, refer to official Polymarket communication channels: Web:  https://polymarket.comTwitter / X:  https://x.com/polymarketDiscord:  https://discord.gg/polymarket"}],"pageTitle":"Does Polymarket have a Token or Planned Airdrop?"},"/docs/guides/FAQ/support":{"sections":[{"heading":{"id":"how-do-i-contact-support","depth":1,"text":"How do I contact Support?"},"content":"Polymarket offers technical support through our website chat feature, and through Discord.To contact support through our website: Navigate to  Polymarket. Click the blue chat icon in the bottom right and start your chat session. For technical support on Discord: Join the Polymarket Discord server through this link:  https://discord.gg/polymarketNavigate to the Support sidebar and click #open-a-ticket. This will open a private conversation with a Polymarket team member. Be aware of numerous scams and malicious links. Polymarket team members will never DM you first or ask for private keys or personal information. Polymarket team members are identified in blue font on Discord."}],"pageTitle":"How do I contact Support?"},"/docs/guides/FAQ/social-good":{"sections":[{"heading":{"id":"how-can-polymarket-support-social-good","depth":1,"text":"How can Polymarket support social good?"},"content":"By aggregating public opinion and insights, Polymarket offers valuable predictions on everything from elections to major global issues like climate change or public health crises. These insights can be used to better inform public policy, prepare for future challenges, and ensure that decision-making is based on real-time, data-driven forecasts rather than outdated or biased information."}],"pageTitle":"Polymarket utility"},"/docs/guides/FAQ/sell-early":{"sections":[{"heading":{"id":"can-i-sell-early","depth":1,"text":"Can I sell early?"},"content":"Yes, you can sell or close your poisiton early.You may sell shares at any point before the market is resolved by either placing a market order to sell shares at the prevailing bid price in the orderbook, or by placing a limit order for how many shares you wish to sell and at what price. The limit order will only be executed if/when there is a willing buyer for your shares at the price you set."}],"pageTitle":"Can I sell early?"},"/docs/guides/FAQ/recover-missing-deposit":{"sections":[{"heading":{"id":"recover-missing-deposit","depth":1,"text":"Recover Missing Deposit"},"content":"If you deposited the wrong cryptocurrency on Ethereum or Polygon, use these tools to recover those funds."},{"heading":{"id":"recover-on-ethereum","depth":3,"text":"Recover on Ethereum"},"content":"Use this tool if you deposited the wrong token on Ethereum. Go to  https://recovery.polymarket.com/ and sign in with your Polymarket account or connect the wallet you use on Polymarket. Select the asset you incorrectly deposited. You’ll then see the asset balance displayed, and will have the ability to recover those funds to your specified wallet."},{"heading":{"id":"recover-on-polygon","depth":3,"text":"Recover on Polygon"},"content":" Use this tool if you deposited the wrong token on Polygon. Go to  https://polymarket-matic-recovery.herokuapp.com/ and sign in with your Polymarket account or connect the wallet you use on Polymarket. Select the asset you incorrectly deposited. You’ll then see the asset balance displayed, and will have the ability to recover those funds to your specified wallet."}],"pageTitle":"Recover Missing Deposit"},"/docs/guides/FAQ/polling":{"sections":[{"heading":{"id":"how-is-polymarket-better-than-traditional-legacy-polling","depth":1,"text":"How is Polymarket better than traditional / legacy polling?"},"content":"While legacy polls capture a snapshot of opinion at a specific moment, they are often outdated by the time they're published—sometimes lagging by several days. In contrast, Polymarket reflects real-time sentiment as events unfold, offering continuous updates and a more dynamic understanding of public opinion. Studies show that prediction markets like Polymarket tend to outperform traditional pollsters because participants are financially incentivized to be correct. This creates more thoughtful, data-driven predictions. Research by James Surowiecki, author of The Wisdom of Crowds, has highlighted how markets like these can be more accurate than polls due to the \"collective intelligence\" of diverse participants. Additionally, the Iowa Electronic Markets, an academic research project at the University of Iowa, has consistently demonstrated the superior accuracy of prediction markets like Polymarket over traditional polling in predicting political outcomes. Polymarket provides a constantly updating picture of public sentiment, offering a degree of accuracy and timeliness that traditional pollsters, who typically report data that is days old, simply cannot match."}],"pageTitle":"Polymarket vs. polling"},"/docs/guides/FAQ/odds":{"sections":[{"heading":{"id":"how-can-polymarket-support-social-good","depth":1,"text":"How can Polymarket support social good?"},"content":"What looks like volatility is actually just real-time, granular analysis of public sentiment, much more up-to-date than traditional polls.People are reacting to what’s happening  right now. So when something big goes down—a debate, a major news story—you’re going to see quick shifts in the market. But that’s not a flaw. In fact, it’s one of Polymarket’s strengths. This isn’t some static poll that’s already out of date by the time it’s published. It’s a living, breathing reflection of public sentiment in real-time."}],"pageTitle":"Polymarket utility"},"/docs/guides/FAQ/is-polymarket-the-house":{"sections":[{"heading":{"id":"is-polymarket-the-house","depth":1,"text":"Is Polymarket the house?"},"content":"No, Polymarket is not the house. All trades happen peer-to-peer (p2p)."},{"heading":{"id":"polymarket-is-different-in-three-ways","depth":2,"text":"Polymarket is different in three ways:"},"content":""},{"heading":{"id":"1-traders-interact-directly-with-each-other-not-with-polymarket","depth":3,"text":"1. Traders interact directly with each other, not with Polymarket."},"content":"Polymarket is a marketplace comprised of traders on both sides of any given market. This means you're always trading with other users, not against a centralized entity or \"house.\" Prices on Polymarket are determined by supply and demand. As traders buy and sell shares in outcomes, prices fluctuate to reflect the collective sentiment and knowledge of market participants."},{"heading":{"id":"2-polymarket-does-not-charge-trading-fees","depth":3,"text":"2. Polymarket does not charge trading fees."},"content":" Unlike bookmakers or wagering operations, Polymarket does not charge deposit/withdrawal fees, or any type of trading fees. This means that Polymarket does not stand to benefit from the outcome of any market or usage of any trader."},{"heading":{"id":"3-transact-at-any-time","depth":3,"text":"3. Transact at any time."},"content":" Polymarket enables you to sell your position at any time before the market resolves, provided there is a willing buyer of your shares. This offers flexibility and allows you to manage your risk and lock in profits or cut losses as you see fit. In essence, Polymarket empowers you to trade based on your own knowledge and research, without going up against a \"house\" with potentially unfair advantages."}],"pageTitle":"Is Polymarket the house?"},"/docs/guides/FAQ/is-my-money-safe":{"sections":[{"heading":{"id":"is-my-money-safe","depth":1,"text":"Is my money safe?"},"content":"Yes. Polymarket is non-custodial, so you're in control of your funds."},{"heading":{"id":"non-custodial-youre-in-control","depth":4,"text":"Non-custodial, you’re in control"},"content":"Polymarket recognizes the importance of a trustworthy environment for managing your funds. To ensure this, Polymarket uses non-custodial wallets, meaning we never take possession of your USDC. This approach gives you full control over your assets, providing protection against potential security threats like hacks, misuse, and unauthorized transactions."},{"heading":{"id":"your-keys-your-funds","depth":3,"text":"Your keys = your funds"},"content":" A private key acts like a highly secure password, essential for managing and moving your assets without restrictions. You can export your private key at any time, ensuring sole access to your funds. Learn how to export your private key  here."},{"heading":{"id":"keep-your-private-keys-private","depth":3,"text":"Keep your private keys private."},"content":" Do not share your private key with others. While Polymarket provides the infrastructure, the security of your assets depends on how securely you handle your private key and passwords. Losing your private key or passwords can result in losing access to your funds. It's crucial to store this information in a safe and secure environment."},{"heading":{"id":"our-commitment","depth":3,"text":"Our Commitment"},"content":" Polymarket aims to give you peace of mind, knowing that your assets are safe and fully under your control at all times. We encourage you to take necessary precautions to secure your digital assets effectively. The ability to manage your private key means you are not reliant on Polymarket to secure your assets; you have the control to ensure your financial security."}],"pageTitle":"Is my money safe?"},"/docs/guides/FAQ/how-to-export-private-key":{"sections":[{"heading":{"id":"how-to-export-your-private-key","depth":1,"text":"How to Export Your Private Key"},"content":"Exporting your private key on Magic.LinkExporting your private key gives you direct control and security over your funds. This process is applicable if you’ve signed up via email. DO NOT share your private key with other parties, platforms, or people. We will never ask for your private key. Access the Export Link while signed into Polymarket:  https://reveal.magic.link/polymarketSign-in on Magic.Link Export Private Key. Once revealed, you should securely store the private key displayed, where others can’t access it. Log out of Magic.Link"}],"pageTitle":"How to Export Your Private Key"},"/docs/guides/FAQ/embeds":{"sections":[{"heading":{"id":"how-to-use-embeds","depth":1,"text":"How to use embeds"},"content":"Adding market embeds to your Substack or website.Polymarket allows you to embed a live-updating widget displaying the latest odds for markets in many places around the web."},{"heading":{"id":"web","depth":3,"text":"Web"},"content":" Navigate to the individual market you want to embed and click the embed (< >) link. Select light or dark mode, and copy the auto-generated code\r\nPaste the code into your code editor or CMS and publish as normal"},{"heading":{"id":"twitter-x","depth":3,"text":"Twitter / X"},"content":" Navigate to any Polymarket market\r\nCopy the URL from your browser\r\nPaste the URL into the compose window"},{"heading":{"id":"substack","depth":3,"text":"Substack"},"content":" The embeds feature currently supports single markets only (eg “USA to Win Most Gold Medals”, not “Most Gold Medals at Paris Olympics’)  To embed a market, navigate on Polymarket.com to the single market you want to embed and click “copy link.” Navigate to your Substack editor and paste the link directly into the body of your newsletter. The editor will recognize the market and convert it to a widget that automatically refreshes with the latest odds."}],"pageTitle":"How to use embeds"},"/docs/guides/FAQ/does-polymarket-have-an-api":{"sections":[{"heading":{"id":"does-polymarket-have-an-api","depth":1,"text":"Does Polymarket have an API?"},"content":"Getting data from PolymarketYes! Developers can find all the information they need for interacting with Polymarket. This includes  documentation on market discovery, resolution, trading etc.. Whether you are an academic researcher a market maker or an indepedent developer, this documentation should provide you what you need to get started. All the code you find linked here and on our  GitHub is open source and free to use. If you have any questions please join our  discord and direct your questions to the #devs channel."}],"pageTitle":"Does Polymarket have an API?"},"/docs/guides/get-started/what-is-polymarket":{"sections":[{"heading":{"id":"what-is-polymarket","depth":1,"text":"What is Polymarket?"},"content":"Polymarket is the world's largest prediction market. It gives you the opportunity to profit from your beliefs by betting on the outcome of future events across various topics such as sports, politics, and pop culture. Our markets reflect accurate, unbiased, real-time probabilities for events that matter most to you. Markets seek truth."},{"heading":{"id":"understanding-prices","depth":3,"text":"Understanding Prices"},"content":" Prices = probabilities. Prices (odds) on Polymarket represent the current probability of an event occurring. For example, in a market predicting whether the Miami Heat will win the 2025 NBA Finals, if “Yes” shares are trading at 18 cents, it indicates a 18% chance of Miami winning."},{"heading":{"id":"making-money-on-markets","depth":3,"text":"Making money on markets"},"content":" In the example above, if you believe Miami's chances of winning are higher than 18%, you would buy “Yes” shares at 18 cents each. If Miami wins, each “Yes” share would be worth $1, resulting in an 82-cent profit per share. Conversely, any trader who owned “No” shares would see their investment become worthless once the game is over. Since it's a market, you're not locked into your trade. You can sell your shares at any time at the current market price. As the news changes, the supply and demand for shares fluctuates, causing the share price to reflect the new odds for the event."},{"heading":{"id":"how-accurate-are-polymarket-odds","depth":3,"text":"How accurate are Polymarket odds?"},"content":" Research shows prediction markets are often more accurate than polls and pundits. Traders aggregate news, polls, and expert opinions, making informed trades. Their economic incentives ensure market prices adjust to reflect true odds as more knowledgeable participants join. This makes prediction markets the best source of real-time event probabilities. People use Polymarket for the most accurate odds, gaining the ability to make informed decisions about the future. If you're an expert on a certain topic, Polymarket is your opportunity to profit from trading based on your knowledge, while improving the market's accuracy."}],"pageTitle":"What is Polymarket?"},"/docs/guides/get-started/what-are-prediction-markets":{"sections":[{"heading":{"id":"what-is-a-prediction-market","depth":1,"text":"What is a Prediction Market?"},"content":"How people collectively forecast the future.A prediction market is a platform where people can bet on the outcome of future events. By buying and selling shares in the outcomes, participants collectively forecast the likelihood of events such as sports results, political elections, or entertainment awards."},{"heading":{"id":"how-it-works","depth":3,"text":"How it works"},"content":" Market Prices = Probabilities: The price of shares in a prediction market represents the current probability of an event happening. For example, if shares of an event are trading at 20 cents, it indicates a 20% chance of that event occurring."},{"heading":{"id":"making-predictions","depth":3,"text":"Making predictions"},"content":" If you believe the actual probability of an event is higher than the market price suggests, you can buy shares. For instance, if you think a team has a better than 20% chance of winning, you would buy shares at 20 cents. If the event occurs, each share becomes worth $1, yielding a profit."},{"heading":{"id":"free-market-trading","depth":3,"text":"Free-market trading"},"content":" You can buy or sell shares at any time before the event concludes, based on new information or changing circumstances. This flexibility allows the market prices to continuously reflect the most current and accurate probabilities."},{"heading":{"id":"trust-the-markets","depth":3,"text":"Trust the markets"},"content":" Prediction markets provide unbiased and accurate probabilities in real time, cutting through the noise of human and media biases. Traditional sources often have their own incentives and slants, but prediction markets operate on the principle of \"put your money where your mouth is.\" Here, participants are financially motivated to provide truthful insights, as their profits depend on the accuracy of their predictions. In a prediction market, prices reflect the aggregated sentiment of all participants, weighing news, data, expert opinions, and culture to determine the true odds. Unlike media narratives, which can be swayed by various biases, prediction markets offer a transparent view of where people genuinely believe we're heading."},{"heading":{"id":"why-use-prediction-markets","depth":4,"text":"Why use prediction markets?"},"content":" Prediction markets are often more accurate than traditional polls and expert predictions. The collective wisdom of diverse participants, each motivated by the potential for profit, leads to highly reliable forecasts. This makes prediction markets an excellent tool for gauging real-time probabilities of future events. Polymarket, the world's largest prediction market, offers a user-friendly platform to bet on a wide range of topics, from sports to politics. By participating, you can profit from your knowledge while contributing to the accuracy of market predictions."}],"pageTitle":"What is a Prediction Market?"},"/docs/guides/get-started/recover-missing-deposit":{"sections":[{"heading":{"id":"recover-missing-deposit","depth":1,"text":"Recover Missing Deposit"},"content":"If you deposited the wrong cryptocurrency on Ethereum or Polygon, use these tools to recover those funds."},{"heading":{"id":"recover-on-ethereum","depth":3,"text":"Recover on Ethereum"},"content":" Use this tool if you deposited the wrong token on Ethereum. Go to  https://recovery.polymarket.com/ and sign in with your Polymarket account or connect the wallet you use on Polymarket. Select the asset you incorrectly deposited. You’ll then see the asset balance displayed, and will have the ability to recover those funds to your specified wallet."},{"heading":{"id":"recover-on-polygon","depth":4,"text":"Recover on Polygon"},"content":" Use this tool if you deposited the wrong token on Polygon. Go to  https://polymarket-matic-recovery.herokuapp.com/ and sign in with your Polymarket account or connect the wallet you use on Polymarket. Select the asset you incorrectly deposited. You’ll then see the asset balance displayed, and will have the ability to recover those funds to your specified wallet."}],"pageTitle":"Recover Missing Deposit"},"/docs/guides/get-started/making-your-first-trade":{"sections":[{"heading":{"id":"making-your-first-trade","depth":1,"text":"Making your First Trade"},"content":"How to buy shares."},{"heading":{"id":"making-your-first-trade","depth":4,"text":"Making your First Trade"},"content":"Once you've signed up and deposited funds, you're ready to start trading on Polymarket. Here's a step-by-step guide to get you started."},{"heading":{"id":"choose-a-market","depth":3,"text":"Choose a Market"},"content":" Visit the markets page to see all available markets. Use the search, sort, and filter tools to narrow down your options and find a market that interests you.\r\nscreen shot"},{"heading":{"id":"buy-shares","depth":3,"text":"Buy Shares"},"content":" Locate the 'buy' modal, on the right side of the screen. Click the outcome you want to buy (usually Yes or No), then enter the dollar amount you wish to invest. Click  Buy and confirm the transaction in your wallet. Once your trade goes through, you'll receive a notification confirming its success. Congrats, you're officially a Polymarket trader!"},{"heading":{"id":"share-your-trade","depth":3,"text":"Share your Trade"},"content":" You'll also see a bet slip to share on social media. We love sending $$$ to traders who post their trades on Twitter and tag us! Simple, right? If you think you've got the hang of it, it's time to learn about more advanced trading and order types.  Limit Orders."}],"pageTitle":"Making your First Trade"},"/docs/guides/get-started/how-to-signup":{"sections":[{"heading":{"id":"how-to-sign-up","depth":1,"text":"How to Sign-Up"},"content":"How to create a Polymarket account.Need Help?\r\nWe're available to guide you through the sign-up process on  Discord."},{"heading":{"id":"email-or-google-sign-up","depth":3,"text":"Email or Google Sign-Up"},"content":" Signing up for Polymarket with your email address or Google account is quick, simple, and secure. Click  Sign Up on the top right of the Polymarket homepage. Enter your email address and click  continue.\r\nYou can also use your Google account to sign in and follow the same procedure. Copy the code provided by Magic.\r\nYou’ll receive an email with the subject “Log in to Polymarket”. Open and click the  Log in to Polymarket button. Enter or  paste the security code.\r\nNote: This page will be hosted on auth.magic.link. You'll see a Login Complete message. Return to your original Polymarket window. Back on Polymarket, you'll be signed in. Choose your display name, agree to the terms of service, opt into email updates, and get started trading."},{"heading":{"id":"crypto-wallet-sign-up","depth":3,"text":"Crypto Wallet Sign-Up"},"content":" Polymarket supports most crypto wallets, including MetaMask, Coinbase Wallet, and others via WalletConnect. Click Sign Up on the Polymarket homepage. Choose your preferred wallet and follow the prompts to connect it to Polymarket. Ensure you are connected to the Polygon Network, your wallet may prompt you to switch networks. Sign the transaction prompt(s) on your wallet app or extension. You're signed in! Choose your display name, agree to the terms of service, opt into email updates, and start trading. If you have MetaMask or Coinbase Wallet browser extensions installed but wish to connect using their mobile apps, you'll need to disable the extensions in your browser settings and reload Polymarket."}],"pageTitle":"How to Sign-Up"},"/docs/guides/get-started/how-to-deposit":{"sections":[{"heading":{"id":"how-to-deposit","depth":1,"text":"How to Deposit"},"content":"How to add cash to your balanace on Polymarket."},{"heading":{"id":"depositing-funds-on-polymarket","depth":3,"text":"Depositing funds on Polymarket"},"content":"This guide will walk you through the deposit process for Polymarket, covering popular methods and step-by-step instructions for buying and depositing USDC. Need Help? For assistance, reach out to us on  Discord."},{"heading":{"id":"about-usdc-and-polygon","depth":3,"text":"About USDC and Polygon"},"content":" Polymarket uses USDC, a federally regulated \"stable coin\" cryptocurrency backed by the US dollar. Learn more here. Polymarket utilizes USDC (USD Coin) on the Polygon network for transactions. By using USDC on Polygon, Polymarket ensures fast and reliable transactions, enhancing the overall user experience."},{"heading":{"id":"how-to-purchase-and-deposit-usdc","depth":2,"text":"How to purchase and deposit USDC"},"content":" USDC is available on most major exchanges, including Coinbase and Robinhood. If your exchange supports sending or withdrawing to Polygon, we recommend this option for faster and fee-free transactions. Alternatively, you can deposit USDC via the Ethereum network."},{"heading":{"id":"deposit-with-crypto-exchanges","depth":2,"text":"Deposit with crypto exchanges"},"content":" For detailed instructions, check out our guides for purchasing and depositing USDC using popular exchanges: Deposit from Coinbase (recommended) Deposit from RobinhoodIf you decide to use an exchange to purchase and send (deposit) USDC to your Polygon deposit address, please ensure you're sending on Polygon Network. If you're unsure, please reach out to support on  Discord."},{"heading":{"id":"deposit-with-visa-or-mastercard","depth":2,"text":"Deposit with Visa or Mastercard"},"content":" MoonPay enables you to buy USDC (on Polygon) using your Visa, Mastercard, and select bank cards. Please be aware that payment options and transaction limits may vary depending on your region.  How to use MoonPay."},{"heading":{"id":"depositing-on-etheruem-and-polygon","depth":2,"text":"Depositing on Etheruem and Polygon"},"content":" You can send USDC with your wallet on Ethereum or USDC.e on Polygon to your respective deposit addresses found on the Deposit page.  Learn more."}],"pageTitle":"How to Deposit"},"/docs/guides/deposits/usdc-on-eth":{"sections":[{"heading":{"id":"deposit-usdc-on-ethereum","depth":1,"text":"Deposit USDC on Ethereum"},"content":"How to deposit USDC on the Ethereum Network to your Polymarket account.Depositing USDC on the Ethereum network to Polymarket will automatically bridge your funds to the Polygon network. On the Polymarket deposit page, under “Other Methods,” click  USDC (ETH). Copy your unique USDC (ETH) deposit address. Send your USDC to the address you just copied on the Ethereum network. This feature is typically called “send” or “withdraw” on most exchanges and wallets. Ensure you are sending USDC to your Polymarket Ethereum deposit address on Ethereum network to avoid any issues. Once your deposit is detected, a countdown timer will begin. You will see \"Deposit Complete\" when your funds are ready to trade. If your countdown timer resets more than once, or if you encounter any issues, please reach out to support on  Discord. "}],"pageTitle":"Deposit USDC on Ethereum"},"/docs/guides/deposits/robinhood":{"sections":[{"heading":{"id":"deposit-with-robinhood","depth":1,"text":"Deposit with Robinhood"},"content":"How to buy and deposit USDC to your Polymarket account using Robinhood Crypto."},{"heading":{"id":"deposit-with-robinhood","depth":1,"text":"Deposit with Robinhood"},"content":"How to buy and deposit USDC to your Polymarket account using Robinhood Crypto."},{"heading":{"id":"how-to-deposit-from-robinhood","depth":3,"text":"How to Deposit from Robinhood"},"content":"You can use Robinhood Crypto to buy and send USDC to Polymarket. You may have to accept separate terms and verify your identity with Robinhood to activate Robinhood Crypto. Navigate to the Crypto tab Under  Explore more Crypto, select  Tradable, and  USDC. If you don't see USDC, it may be in your  Holdings. Buy your desired USDC amount. Once entered, select  review, then  submit. On the USDC page select  send and Enter the amount you'd like to send (deposit) Paste your Polymarket deposit address\r\nYour Polymarket deposit address can be found by copying the Address for USDC (Polygon) on the Polymarket deposit page. The address pictured is just an example. Please only copy your own address, which is on the deposit page. On the \"Choose network\" page, select  Polygon (Matic) Network. Select  Continue. Enter your desired amount and select  Review, and then  Submit."}],"pageTitle":"Deposit with Robinhood"},"/docs/guides/deposits/moonpay":{"sections":[{"heading":{"id":"deposit-using-your-card-or-pay-pal","depth":1,"text":"Deposit Using Your Card or PayPal"},"content":"Use MoonPay to deposit cash using your Visa, Mastercard, Bank and PayPal.Access MoonPay by click  Buy USDC on the  Deposit Page. Check out  MoonPay's guide for further instructions."}],"pageTitle":"Deposit Using Your Card or PayPal"},"/docs/guides/deposits/large-cross-chain-deposits":{"sections":[{"heading":{"id":"large-cross-chain-deposits","depth":1,"text":"Large Cross Chain Deposits"},"content":"For deposits over $50,000 we recommended to use bridges and ensure minimal fee's (slippage)."},{"heading":{"id":"recommended-bridges","depth":2,"text":"Recommended Bridges"},"content":"For large deposits (>$50,000) originating from a chain other than Polygon, we recommend using one of the following bridges. Ensure you bridge to your Polymarket Polygon deposit address (screenshot below). Please be mindful of potential slippage during the transaction. DeBridgeAcrossPortalPolymarket is not affiliated with, responsible for, or makes any guarantees regarding any third-party bridge. Users are advised to review the Terms of Use or other relevant documentation for third-party bridges."},{"heading":{"id":"important-notes","depth":2,"text":"Important Notes"},"content":" You can deposit USDC or USDC.e to your Polymarket Polygon wallet. If you deposit USDC (native), you will be prompted to \"activate funds,\" which will swap this to USDC.e via the lowest fee Uniswap pool, ensuring slippage of less than 10 basis points (bps). If you encounter any issues with the deposit process, please reach out to us on Discord for assistance."}],"pageTitle":"Large Cross Chain Deposits"},"/docs/guides/deposits/how-to-withdraw":{"sections":[{"heading":{"id":"how-to-withdraw","depth":1,"text":"How to Withdraw"},"content":"How to withdraw your cash balance from Polymarket."},{"heading":{"id":"withdrawing-from-polymarket-is-simple-instant-and-free","depth":3,"text":"Withdrawing from Polymarket is simple, instant, and free."},"content":"Go to the Polymarket funds page and click on the  Withdraw button. Enter the USDC address you wish to withdraw to. Make sure the address supports USDC on the Polygon network. Then, enter the amount you want to withdraw. Click  Withdraw. Your funds will be transferred instantly."}],"pageTitle":"How to Withdraw"},"/docs/guides/deposits/coinbase":{"sections":[{"heading":{"id":"deposit-with-coinbase","depth":1,"text":"Deposit with Coinbase"},"content":"How to buy and deposit USDC to your Polymarket account using Coinbase.Depositing directly to Polymarket from Coinbase is simple and easy. If you need help creating a Coinbase account, see their  guide on coinbase.com."},{"heading":{"id":"buy-usdc-on-coinbase","depth":2,"text":"Buy USDC on Coinbase"},"content":" Click  Transfer on the Coinbase homepage. Click  Deposit Cash then in  Deposit, select  Deposit USDC. Enter an amount & connect a payment method under  Transfer from. Click  Preview, review the Order Preview, then click  Deposit cash now. You'll see a  “Your deposit is pending” screen. You'll receive a confirmation email from Coinbase when your USDC purchase is successful. If something went wrong along the way, we recommend reaching to Coinbase support."},{"heading":{"id":"send-usdc-to-your-polymarket-account","depth":2,"text":"Send USDC to your Polymarket account"},"content":" Click  Send & Receive. Under  Asset, select USD Coin. Note: you may have to search for it. Enter the amount you wish to send (deposit) to Polymarket. Under  To, enter your Polymarket deposit address. You can find yours on the Polymarket Deposit page. Then click  Continue.\r\nEnsure you have copied your address for the Polygon network, as depicted below. Change the network to Polygon to ensure you're sending on the right network. Under  Network, select Polygon. Click  Send Now. Your deposit will be available to trade on Polymarket in a few minutes. Back on the Polymarket deposit page, Click  Confirm pending deposit."}],"pageTitle":"Deposit with Coinbase"}}